Tekla.Structures.Catalogs.ProfileItemCrossSection
The Tekla.Structures.Catalogs.ProfileItemCrossSection contains the information of the cross section
information for multi-cross section profiles.

Tekla.Structures.Catalogs.ProfileItemCrossSection.MAX_PROFILE_ITEM_PARAMETERS
The maximum number of profile item parameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.CrossSectionNumber
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.CrossSectionNumber.

Tekla.Structures.Catalogs.ProfileItemCrossSection.Number
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.Number.

Tekla.Structures.Catalogs.ProfileItemCrossSection.CrossSectionLocation
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.CrossSectionLocation.

Tekla.Structures.Catalogs.ProfileItemCrossSection.Location
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.Location.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileType
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileType.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileSubType
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileSubType.

Tekla.Structures.Catalogs.ProfileItemCrossSection.EquivalentType
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.EquivalentType.

Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemAnalysisParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemAnalysisParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemAnalysisParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemAnalysisParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemUserParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.NumberOfProfileItemUserParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemUserParameters
Gets or sets a value of the property Tekla.Structures.Catalogs.ProfileItemCrossSection.ProfileItemUserParameters.

Tekla.Structures.Catalogs.ProfileItemCrossSection.AddProfileItemParamter(System.String,System.String,System.String,System.Object,Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum,System.Int32)
adds a new profile item parameter.
property: The name of the property.
alblString: The translation string.
symbol: The property symbol.
value: The value of the property.
ParameterUnitType: The property value unit type.
crossSectionNumber: The cross-section number.

Tekla.Structures.Catalogs.ProfileItemCrossSection.AddProfileItemAnalysisParamter(System.String,System.String,System.String,System.Object,Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum,System.Int32)
adds a new profile item analisis parameter.
property: The name of the property.
alblString: The translation string.
symbol: The property symbol.
value: The value of the property.
ParameterUnitType: The property value unit type.
crossSectionNumber: The cross-section number.

Tekla.Structures.Catalogs.ProfileItemCrossSection.AddProfileItemUserParamter(System.String,System.String,System.String,System.Object,Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum,System.Int32)
adds a new profile item user parameter.
property: The name of the property.
alblString: The translation string.
symbol: The property symbol.
value: The value of the property.
ParameterUnitType: The property value unit type.
crossSectionNumber: The cross-section number.

Tekla.Structures.Catalogs.ProfileItemCrossSection.ToStruct(Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
To structure.
profileItemCrossSection: The profile item cross section.

Tekla.Structures.Catalogs.ProfileItemCrossSection.FromStruct(Tekla.Structures.CatalogInternal.dotcatProfileItemCrossSection_t@)
From the structure.
profileItemCrossSection: The profile item cross section.

Tekla.Structures.Catalogs.ProfileItemCrossSection.CreateParamter(System.String,System.String,System.String,System.Object,Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum,System.Int32)
Creates a new profile item parameter.
property: The name of the property.
alblString: The translation string.
symbol: The property symbol.
value: The value of the property.
ParameterUnitType: The property value unit type.
crossSectionNumber: The cross-section number.